Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: འདི་ལ་ཁྱོད་ཡི་མ་འཆད་ཅིག །
en: Therefore, you cannot lift it.”

source: དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀཽ་ཤི་ཀ་ཁྱོད་རྡོ་རྗེ་འཆང་བ་ཞེས་བྱ་ན་རྡོ་རྗེ་འདི་སའི་སྟེང་འདི་ནས་ཐེག་ཤིག །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རང་གི་སྟོབས་ཀྱི་ཤུགས་དང་། རྫུ་འཕྲུལ་གྱི་སྟོབས་དང་།
en: Then King Ajātaśatru said to Śakra, Lord of the Gods, “Kauśika, you are called ‘The Vajra-Bearer.’ Lift this vajra off the ground.”

source: སྟོབས་ཀྱི་ཤུགས་ཐམས་ཅད་བསྟན་ཀྱང་རྡོ་རྗེ་དེ་བསྐྱོད་པའམ། བསྒུལ་བར་མ་ནུས་སོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ངོ་མཚར་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Yet, even though he was in possession of a great reserve of power, both the power of his superhuman powers and his own incredible strength, Śakra, Lord of the Gods, was unable to move or budge the vajra.

source: བཅོམ་ལྡན་འདས་བདག་གང་གི་ཚེ་ལྷ་མ་ཡིན་དང་གཡུལ་འགྱེད་པ་དེའི་ཚེ་ལག་པ་གཡས་པས་ལྷ་མ་ཡིན་གྱི་དབང་པོ་ཐག་ཟངས་རིས་ཀྱི་ཤིང་རྟ་དཔག་ཚད་བདུན་བརྒྱ་པ་དྲག་ཏུ་མཆི་བ་ཡང་འཛིན་པའི་རྔོ་ཐོག་ན།
en: Awestruck, Śakra, Lord of the Gods, then said to the Blessed One, “At a time when I was waging war on the asuras, Blessed One, I was able to lift the chariot of the asura lord Vemacitra with just one hand, even though the chariot was more than seven hundred leagues long.

source: བདག་གིས་རྡོ་རྗེ་ཆུང་ངུ་འདི་བསྐྱོད་པའམ།
en: Still, I am unable to move or even budge this mere trifle of a vajra.

source: བསྒུལ་བའི་རྔོ་མ་ཐོག་པ་འདི་བཅོམ་ལྡན་འདས་ཅི་ལགས།
en: Blessed One, is this due to the empowering authority of the Buddha?”

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་རྡོ་རྗེ་འདི་ནི་ལྕི་སྟེ། འདི་ལ་ངའི་བྱིན་གྱི་རླབས་མ་ཡིན་པར་རིག་པར་བྱའོ། །
en: “Kauśika,” the Blessed One said, “this vajra is heavy, but it should be understood that this is not due to my empowering authority.

source: ཀཽ་ཤི་ཀ་འདི་ཇི་སྙམ་དུ་སེམས།
en: What do you think, Kauśika?

source: རིའི་རྒྱལ་པོ་རི་རབ་ལྕི་བ་ཡིན་ནམ། གསོལ་པ།
en: Is Mount Meru, the king of mountains, heavy?”

source: བཅོམ་ལྡན་འདས་རིའི་རྒྱལ་པོ་རི་རབ་ཇི་ཙམ་དུ་ལྕི་བ་ནི་དཔེར་བགྱི་བར་ཡང་སླ་བ་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་རྡོ་རྗེ་འདི་ནི་ལྕི་སྟེ།
en: “Mount Meru is so heavy, Blessed One, that it would not be easy to describe how much, even by analogy.”

source: ཀཽ་ཤི་ཀ་གལ་ཏེ་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་རྡོ་རྗེ་འདི་རྡོ་རྗེའི་རང་བཞིན་གྱི་འཁོར་ཡུག་གི་རིལ་བསྣུན་ན་དེ་ཡང་དཔེར་ན་ཕུབ་མ་སྤར་གང་གཏོར་བ་བཞིན་དུ་རྣམ་པར་འཐོར་ཏེ།
en: “Kauśika,” continued the Blessed One, “this vajra is heavy, so much so that, for example, Kauśika, if Vajrapāṇi, Lord of the Guhyakas, were to strike it against the Cakravāḍa Mountains, which form this world’s perimeter and are made of vajra, they would be pulverized into tiny bits no bigger than chaff.

source: ཀཽ་ཤི་ཀ་རྡོ་རྗེ་འདིའི་སྟོབས་ཀྱི་ཤུགས་ནི་དེ་ཙམ་མོ། །
en: This vajra has that much incredible power, Kauśika.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཁྱོད་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་རྣམས་ཀྱི་ནང་ན་རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་ཏུ་བསྟན་པ་ཡིན་ན་རྡོ་རྗེ་འདི་སའི་སྟེང་འདི་ནས་ཐེག་ཤིག །དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་འདི་སྙམ་དུ་བསམས་ཏེ། གལ་ཏེ་བདག་གིས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་འདིའི་མདུན་དུ་རྡོ་རྗེ་འདི་གདེག་པར་མ་ནུས་ན་ནི་བདག་ལ་དབང་ཟ་བར་འགྱུར་རོ། །
en: Śakra, Lord of the Gods, then said to Venerable Maudgalyāyana the Great, “Revered Maudgalyāyana the Great, since you are foremost among the Blessed One’s disciples in the possession of superhuman powers, lift this vajra off the ground.”

source: སྙམ་ནས་དེས་དེ་འདྲ་བའི་སྟོབས་ཀྱི་ཤུགས་ཀྱིས་རྡོ་རྗེ་དེ་བཟུང་བ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་རབ་ཏུ་གཡོས་ཏེ། ཆུ་ཡང་གནམ་དུ་རྒལ་ཅིང་། རྒྱ་མཚོ་ཐམས་ཅད་འཁྲུགས་ཀྱང་རྡོ་རྗེ་དེ་བསྐྱོད་པའམ། བསྒུལ་བར་མ་ནུས་སོ། །
en: The thought then occurred to Venerable Maudgalyāyana the Great, “If I am unable to pick up this vajra in front of this world and its gods, then I would become an impostor.” So, he grasped the vajra with such incredible strength that the cosmos of a billion worlds quaked in six ways, the rivers overflowed, and the oceans roiled, but he could not move or even budge the vajra.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ངོ་མཚར་དུ་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Venerable Maudgalyāyana the Great was awestruck.

source: འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་བཅོམ་ལྡན་འདས་ཀྱིས་ཉན་ཐོས་རྣམས་ཀྱི་ནང་ན་རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་ཏུ་བསྟན་པ་ལགས་ཏེ།
en: He bowed his head at the feet of the Blessed One and said, “Blessed One, you have declared that I am foremost among the Blessed One’s disciples in the possession of superhuman powers.

source: བཅོམ་ལྡན་འདས་བདག་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་དེ་ལྟར་དབང་ཆེ་བར་གྲགས་ལ་དེ་ལྟར་མཐུ་ཆེ་བ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་བདག་གང་གི་ཚེ་འཚལ་ན་རྒྱ་མཚོ་ཆེན་པོ་བཞིའི་ཆབ་ཀྱི་ཕུང་པོ་ལག་མཐིལ་གཅིག་ཏུ་འཇོག་གོ། །
en: Blessed One, I have such great superhuman powers, such great exalted status, and such great majestic power that, if I wish, Blessed One, I can even hold all the water in the four great oceans in the palm of my hand.

source: བཅོམ་ལྡན་འདས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་དཔེར་བགྱི་ན་མི་ལ་ལ་ཞིག་གིས་ཀར་ཥ་པ་ཎ་གཅིག་མཛུབ་མོའི་རྩེ་མོས་བསྒྲེ་བཟློག་པ་དེ་བཞིན་དུ་བདག་གིས་བསྒྲེ་བཟློག་གོ། །
en: Blessed One, I could even make this cosmos of a billion worlds revolve in one direction and then reverse direction, just as if someone were rolling a coin back and forth with the tips of their fingers.

source: བཅོམ་ལྡན་འདས་ཉི་མ་དང་ཟླ་བ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་མཆི་བ་ཡང་བདག་གིས་ཐོགས་པར་བགྱིད་དོ། །
en: Blessed One, I can even touch the sun and moon, which have such great superhuman power and such great majestic power.

source: རིའི་རྒྱལ་པོ་རི་རབ་ཀྱང་ལག་པ་ཡ་གཅིག་གིས་བླངས་ཏེ་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་འཕེན་ཏོ། །
en: With one hand, I could even pick up Mount Meru, the king of mountains, and throw it as far as the world of Brahmā.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། ཉེ་དགའ་བོ་དེ་གཉིས་ཀྱང་བཏུལ་ཏོ། །
en: Blessed One, I have even tamed the nāga kings Nanda and Upananda.

source: བཅོམ་ལྡན་འདས་བདག་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་ཅན་དུ་ཡང་མཆིས།
en: Blessed One, I have even traveled to the Marīcika world.

source: བདག་གིས་རི་རབ་ཙམ་གྱི་ཁམས་དེ་དག་ཀྱང་འཚལ་འཚལ་ན། བཅོམ་ལྡན་འདས་བདག་གིས་རྡོ་རྗེ་འདི་ལྟར་ཆུང་བ་འདི་བསྐྱོད་པའམ། བསྒུལ་བའི་རྔོ་ཡང་མ་ཐོག་པ་འདི་བཅོམ་ལྡན་འདས་བདག་རྫུ་འཕྲུལ་གྱི་སྟོབས་དེ་ལས་ཡོངས་སུ་ཉམས་པའམ་གཅིག་ཏུ་མ་གྱུར་ལགས་སམ།
en: Blessed One, when I can do what I want even with things as large as Mount Meru, does the fact that I cannot move or even budge this mere trifle of a vajra indicate that the power of my superhuman powers is insufficient, Blessed One, or am I not the only one?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཁྱོད་རྫུ་འཕྲུལ་གྱི་སྟོབས་དེ་ལས་ཡོངས་སུ་ཉམས་པ་ནི་མེད་མོད་ཀྱི།
en: “Maudgalyāyana the Great,” the Blessed One answered, “it is not that the force of your superhuman powers is insufficient.

source: བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཀྱི་བྱིན་གྱི་རླབས་འདི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་རྣམ་པར་དཀྲུག་པར་མི་ནུས་ན། སེམས་ཅན་གཞན་དག་གིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Rather, when the empowering authority of a bodhisattva’s power cannot be shaken even by all the disciples and solitary buddhas, what more needs to be said about other beings?

source: མཽད་གལ་གྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་རིའི་རྒྱལ་པོ་རི་རབ་ཡོད་པ་རྣམས་ནི་བསྐྱོད་པའམ། བསྒུལ་བར་ནུས་ཀྱི། རྡོ་རྗེ་འདི་ནི་ས་ཕྱོགས་འདི་ནས་བསྐྱོད་པའམ། བསྒུལ་བར་མི་ནུས་སོ། །
en: Maudgalyāyana, even if you were able to move the Mount Merus, those kings of mountains, that exist in as many buddha domains as there are grains of sand in the Ganges River, you would still not be able to move this vajra from its place, even slightly.”

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ལྟར་རྡོ་རྗེ་འདི་འཆང་བས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ནི་སྟོབས་ཆེ་བ་ལགས་སོ། །
en: Venerable Maudgalyāyana the Great then asked, “Does the fact that he holds this vajra, Blessed One, give Vajrapāṇi, Lord of the Guhyakas, great power?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་འཇིག་རྟེན་གྱི་ཁམས་ན་རི་རབ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་རི་གཅིག་ཏུ་གྱུར་ཀྱང་དེ་ནི་གདེག་པར་ནུས་ཀྱི། རྡོ་རྗེ་འདི་ནི་གདེག་པར་མི་ནུས་སོ། །
en: “Maudgalyāyana,” the Blessed One answered, “even if all the Mount Merus that exist in this cosmos of a billion worlds were made into a single mountain and you were able to lift even that mountain, you would still not be able to lift this vajra.”

source: དེ་ནས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ངོ་མཚར་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་རྡོ་རྗེ་འདི་འཆང་བས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་འདི་ནི་སྟོབས་ཀྱི་ཤུགས་ཆེན་པོ་དང་ལྡན་པ་ལགས་ཏེ་ངོ་མཚར་ཏོ། །
en: At this, the elder, Maudgalyāyana the Great, was awestruck, and he said to the Blessed One, “It is marvelous, Blessed One, that Vajrapāṇi, Lord of the Guhyakas, has the incredible power to hold this vajra.

source: བཅོམ་ལྡན་འདས་ཇི་ལགས། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེའི་སྟོབས་དེ་ཕ་མ་ལས་གྱུར་པ་ལགས་སམ།
en: Blessed One, did Vajrapāṇi, Lord of the Guhyakas, inherit this power from his parents, or is it the power of his own superhuman powers?”

source: འོན་ཏེ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་ཕ་མ་ལས་གྱུར་པའི་སྟོབས་དེ་ནི་གང་ཅི་ཡང་རུང་སྟེ་འཇུག་པ་ཙམ་དུ་མིང་བསྟན་པར་ཟད་དོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྫུ་འཕྲུལ་གྱི་སྟོབས་དེ་མ་ལུས་པར་བསྟན་ན་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་མྱོ་མྱོ་པོར་འགྱུར་རོ། །
en: The Blessed One answered, “Maudgalyāyana, the power that comes from human parents is sufficiently explained just by giving it a suitable name, whatever it may be, but if one were to explain fully the power of the superhuman powers of the bodhisattvas, then the world and its gods would be driven mad.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གླང་པོ་ཆེའི་ལྟ་སྟངས་ཀྱིས་ཕྱོགས་ཐམས་ཅད་དུ་ཀུན་ཏུ་གཟིགས་ཏེ། གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གསང་བ་པའི་བདག་པོ་ཁྱོད་ཀྱིས་རྡོ་རྗེ་འདི་སའི་སྟེང་འདི་ནས་ཐེག་ཤིག །
en: At that point, the Blessed One surveyed all the directions with the gaze of a bull elephant, and then he said to Vajrapāṇi, Lord of the Guhyakas, “Lift this vajra from the ground, Lord of the Guhyakas!”

source: དེ་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གཡོས་པར་བྱས་ནས་སའི་སྟེང་དེ་ནས་རྡོ་རྗེ་དེ་ལག་པ་གཡོན་པས་བླངས་ཏེ། སྟེང་གི་བར་སྣང་དུ་འཕངས་ནས་དེས་དེ་བར་སྣང་ལ་ལན་བདུན་བསྐོར་ཏེ། ལག་པ་གཡས་པར་གཞག་གོ། །
en: Then, with his left hand, Vajrapāṇi, Lord of the Guhyakas, lifted the vajra, which shook this cosmos of a billion worlds, and he threw it into the air, at which point it circled the sky seven times and returned to his right hand.

source: དེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་དུ་གྱུར་ཏེ་ཐལ་མོ་སྦྱར་ནས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ལ་ཕྱག་འཚལ་ཏེ། འདི་ལྟར་རྡོ་རྗེ་འདི་འཆང་བས་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེ་ཇི་ཙམ་དུ་སྟོབས་ཀྱི་ཤུགས་དང་ལྡན་པ་ནི་ངོ་མཚར་ཏོ། །
en: Thereupon everyone in the assembly was awestruck, and stretching out their arms, palms together in a gesture of salutation, they paid homage to Vajrapāṇi, Lord of the Guhyakas, and said, “It is marvelous that the Lord of the Guhyakas possesses such incredible strength that he can hold this vajra in that way.

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ཀྱང་འདི་ལྟ་བུའི་སྟོབས་དང་ལྡན་པར་གྱུར་ཅིག་ཅེས་སྨྲས་སོ། །
en: Blessed One, may all beings come to possess such incredible power!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དུ་དང་ལྡན་ན་སྟོབས་འདི་ལྟ་བུ་འཐོབ།
en: King Ajātaśatru then asked the Blessed One, “By means of what things, Blessed One, can a bodhisattva obtain that kind of power?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཅུ་དང་ལྡན་ན་སྟོབས་འདི་ལྟ་བུ་འཐོབ་སྟེ།
en: “Great King,” the Blessed One answered, “bodhisattvas can obtain that kind of power by means of ten things.

source: རྒྱལ་པོ་ཆེན་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལུས་དང་སྲོག་ནི་ཡོངས་སུ་གཏོང་གི་དམ་པའི་ཆོས་ནི་ཡོངས་སུ་མི་གཏོང་བ་དང་།
en: Great King, they are the following: bodhisattvas give up their bodies and their lives, and they never give up the true Dharma;

source: སེམས་ཅན་ཐམས་ཅད་ལ་འདུད་ཅིང་ང་རྒྱལ་འཕེལ་བར་མི་བྱེད་པ་དང་།
en: they bow down to all beings, and they do not allow their pride to rise;

source: སེམས་ཅན་མཐུ་ཆུང་བ་རྣམས་ལ་བཟོད་ཅིང་ཁོང་ཁྲོ་བར་མི་བྱེད་པ་དང་།
en: they have patience with beings who have little strength, and they do not act out of anger;

source: སེམས་ཅན་བཀྲེས་པ་རྣམས་ལ་ཁ་ཟས་བཟང་པོ་མཆོག་སྦྱིན་པ་དང་། སེམས་ཅན་འཇིགས་པ་རྣམས་ལ་མི་འཇིགས་པ་སྦྱིན་པ་དང་།
en: they provide the supreme nourishment to feed beings who are starving, and they give fearlessness to beings who are fearful;

source: སེམས་ཅན་ནད་པ་རྣམས་ལ་ཡང་དག་པའི་གསོ་བ་བྱ་བར་སྤྲོ་བ་དང་།
en: they bring joy through the work of healing those beings who are sick;

source: སེམས་ཅན་དབུལ་པོ་རྣམས་ལ་ལོངས་སྤྱོད་དག་གིས་ཚིམ་པར་བྱེད་པ་དང་།
en: they bring contentment by providing resources to beings in poverty;

source: དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་རྡོ་ཐལ་གྱིས་སྐུད་པ་དང་།
en: they apply coats of plaster to the shrines of the realized ones;

source: སེམས་ཅན་རྣམས་ལ་ཀུན་ཏུ་དགའ་བར་འགྱུར་བའི་ཚིག་སྒྲོགས་པ་དང་།
en: they cause words to be heard that fill beings with complete joy;

source: སེམས་ཅན་དབུལ་པོ་སྡུག་བསྔལ་བ།
en: they distribute wealth to beings who are destitute and suffering;

source: ངལ་བ་ཆད་པ་རྣམས་ཀྱི་ཁུར་ཁྱེར་བ་སྟེ།
en: and they bear the burdens of those beings who are exhausted and languishing.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་སྟོབས་འདི་ལྟ་བུ་འཐོབ་བོ། །གསོལ་པ།
en: By means of these ten things, Great King, bodhisattvas obtain that kind of power.”

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཅང་ཤེས་པ་ལ་གནས་ཤིང་ཅང་ཤེས་པའི་འགྲོ་བར་འགྲོ་བ་ལགས།
en: “Blessed One, how do bodhisattvas remain well bred, and how are they reborn in the places of rebirth of those who are well bred?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྒྱད་དང་ལྡན་ན་ཅང་ཤེས་པར་འགྱུར་ཞིང་ཅང་ཤེས་པའི་འགྲོ་བར་འགྲོ་སྟེ།
en: “Great King,” the Blessed One answered, “bodhisattvas who have eight qualities become well bred and are reborn in the places of rebirth of those who are well bred.

source: བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these eight?

source: བཀའ་བློ་བདེ་བ་དང་། དྲང་བ་དང་། མཉེན་པ་དང་། དེས་པ་དང་། གཡོ་མེད་པ་དང་།
en: They are as follows: good speech, honesty, flexibility, mildness, steadiness, forthrightness, contentedness, and having a mind that is ready for any endeavor.

source: སྒྱུ་མེད་པ་དང་། ཕྲག་དོག་མེད་པ་དང་། སེམས་ལས་སུ་རུང་བ་སྟེ། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་ཅང་ཤེས་པར་འགྱུར་ཞིང་ཅད་ཤེས་པའི་འགྲོ་བར་འགྲོའོ། །གསོལ་པ།
en: Great King, bodhisattvas who have these eight qualities become well bred and are reborn in the places of rebirth of those who are well bred.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཅང་ཤེས་ཀྱི་འགྲོ་བ་དུ་ཞིག་མཆིས།
en: “What are the places of rebirth of those bodhisattvas who are well bred, Blessed One?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཅང་ཤེས་ཀྱི་འགྲོ་བ་བཞི་སྟེ།
en: “Great King, there are four places of rebirth of those bodhisattvas who are well bred.

source: གང་གི་ཚེ་མིའི་འཇིག་རྟེན་དུ་སྐྱེས་པ་དེའི་ཚེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་ཏེ། དེར་ཡང་སངས་རྒྱས་འབྱུང་བ་མཉེས་པར་བྱེད་པ་དང་།
en: If they are born in the human world, they become a wheel-turning king and have the privilege of serving the buddha who arises in that very place.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དུ་འགྱུར་ཏེ། དེར་ཡང་སངས་རྒྱས་འབྱུང་བ་མཉེས་པར་བྱེད་པ་དང་།
en: If they are reborn as Śakra, Lord of the Gods, they have the privilege of serving the buddha who arises in that very place.

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པར་འགྱུར་ཏེ། དེར་ཡང་སངས་རྒྱས་འབྱུང་བ་མཉེས་པར་བྱེད་པ་དང་།
en: If they are reborn as Brahmā, sovereign of this Sahā world, they have the privilege of serving the buddha who arises in that very place.

source: ཁྱིམ་བདག་ཚོང་དཔོན་དུ་འགྱུར་ཏེ། དེར་ཡང་སངས་རྒྱས་འབྱུང་བ་མཉེས་པར་བྱེད་པ་སྟེ།
en: If they are reborn as the head of a household or a guild of tradesmen, they have the privilege of serving the buddha who arises in that very place.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཅང་ཤེས་ཀྱི་འགྲོ་བའོ། །
en: Great King, these are the four places of rebirth of those bodhisattvas who are well bred.”

source: རྒྱལ་པོ་མ་སྐྱེས་དགྲས་གསོལ་པ། བཅོམ་ལྡན་འདས་དད་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: King Ajātaśatru asked, “Blessed One, what is the natural consequence of faith?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དད་པའི་རྒྱུ་འཐུན་པ་ནི་དགེ་བའི་བཤེས་གཉེན་ནོ། །གསོལ་པ།
en: “Great King,” the Blessed One answered, “companions in what is good are the natural consequence of faith.”

source: བཅོམ་ལྡན་འདས་སྦྱིན་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of generosity?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སྦྱིན་པའི་རྒྱུ་འཐུན་པ་ནི་ལོངས་སྤྱོད་དོ། །
en: “Great King, the natural consequence of generosity is wealth.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཐོས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of learning?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ནི་ཤེས་རབ་བོ། །
en: “Great King, the natural consequence of learning is discernment.”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་ཚུལ་ཁྲིམས་ཀྱི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of moral conduct?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་རྒྱུ་འཐུན་པ་ནི་བདེ་འགྲོ་ཐམས་ཅད་དུ་འགྲོ་བའོ། །
en: “Great King, good places of rebirth are the natural consequence of moral conduct.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བཟོད་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of patience?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བཟོད་པའི་རྒྱུ་འཐུན་པ་ནི་སེམས་ཅན་རྗེས་སུ་སྲུང་བའོ། །
en: “Great King, the natural consequence of patience is the protection of beings.”

source: གསོལ་བ། བཅོམ་ལྡན་འདས་བརྩོན་འགྲུས་ཀྱི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of heroic effort?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་རྒྱུ་འཐུན་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །
en: “Great King, the natural consequence of heroic effort is fulfillment of the qualities of a buddha.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བསམ་གཏན་གྱི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of meditation?”

source: བཀའ་སྩལ་བ། རྒྱལ་པོ་ཆེན་པོ་བསམ་གཏན་གྱི་རྒྱུ་འཐུན་པ་ནི་ཉེ་བར་ཞི་བའོ། །
en: “Great King, the natural consequence of meditation is calming.”

source: གསོལ་པ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of wisdom?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཤེས་རབ་ཀྱི་རྒྱུ་འཐུན་པ་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་སེལ་བའོ། །གསོལ་པ།
en: “Great King, the natural consequence of wisdom is the elimination of all afflictions.”

source: བཅོམ་ལྡན་འདས་ཆོས་ཉན་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of hearing the Dharma?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཉན་པའི་རྒྱུ་འཐུན་པ་ནི་ཐེ་ཙོམ་སྤོང་བའོ། །
en: “Great King, the natural consequence of hearing the Dharma is that one lets go of doubts.”

source: གསོལ་བ། བཅོམ་ལྡན་འདས་ཆོས་ཡོངས་སུ་འདྲི་བའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of inquiry into Dharma?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཡོངས་སུ་འདྲི་བའི་རྒྱུ་འཐུན་པ་ནི་སོམ་ཉི་མེད་པའོ། །
en: “Great King, the natural consequence of inquiry into Dharma is certainty.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དབེན་བར་གནས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of a place of solitude?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དབེན་པར་གནས་པའི་རྒྱུ་འཐུན་པ་ནི་བསམ་གཏན་དང་མངོན་པར་ཤེས་པ་ཐོབ་པའོ། །གསོལ་པ།
en: “Great King, the concentrations and the supernormal faculties are the natural consequence of a place of solitude.”

source: བཅོམ་ལྡན་འདས་བསྒོམ་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས། བཀའ་སྩལ་པ།
en: “Blessed One, what is the natural consequence of meditative cultivation?”

source: རྒྱལ་པོ་ཆེན་པོ་བསྒོམ་པའི་རྒྱུ་འཐུན་པ་ནི་འབྲལ་བའོ། །
en: “Great King, the natural consequence of meditative cultivation is liberation.”

source: གསོལ་བ་བཅོམ་ལྡན་འདས་མི་རྟག་པ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of hearing that things are impermanent?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་མི་རྟག་པ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ནི་ཡོངས་སུ་འཛིན་པ་འདོར་བའོ། །
en: “Great King, the natural consequence of hearing that things are impermanent is that one gives away one’s possessions.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་སྡུག་བསྔལ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of hearing about suffering?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སྡུག་བསྔལ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ནི་ཉེ་བར་ལེན་པ་མེད་པའོ། །
en: “Great King, the natural consequence of hearing about suffering is that one stops clinging.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་མེད་པ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of hearing that things have no self?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བདག་མེད་པ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ནི་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་འགོག་པའོ། །གསོལ་པ།
en: “Great King, the natural consequence of hearing that things have no self is that one stops holding on to the concepts of ‘I’ and ‘mine.’ ”

source: བཅོམ་ལྡན་འདས་ཞི་བ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of hearing that nirvāṇa is peace?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཞི་བ་ཐོས་པའི་རྒྱུ་འཐུན་པ་ནི་ཉེ་བར་ཞི་བའོ། །
en: “Great King, the natural consequence of hearing that nirvāṇa is peace is calming.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཚུལ་བཞིན་ཡིད་ལ་བགྱིད་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of careful attention?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པའི་རྒྱུ་འཐུན་པ་ནི་འཕགས་པའི་ཡང་དག་པའི་ལྟ་བ་སྐྱེ་བའོ། །
en: “Great King, the natural consequence of careful attention is the right view of the noble ones.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ལུས་དང་སེམས་དབེན་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of the isolated and free state of one’s mind and body?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ལུས་དང་སེམས་དབེན་པའི་རྒྱུ་འཐུན་པ་ནི་བསམ་གཏན་དང་མངོན་པར་ཤེས་པ་སྐྱེ་བའོ། །
en: “Great King, the natural consequence of the isolated and free state of one’s mind and body is the development of the meditative states and the supernormal faculties.”

source: གསོལ་པ། །བཅོམ་ལྡན་འདས་ལམ་གྱི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of the path?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ལམ་གྱི་རྒྱུ་འཐུན་པ་ནི་འབྲས་བུ་མངོན་པར་རྟོགས་པའོ། །གསོལ་པ།
en: “Great King, the natural consequence of the path is the realization of the goal.”

source: བཅོམ་ལྡན་འདས་མོས་པའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of ardent devotion?

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་མོས་པའི་རྒྱུ་འཐུན་པ་ནི་རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །
en: “Great King, the natural consequence of ardent devotion is the fulfillment of liberation.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་སངས་རྒྱས་འབྱུང་བའི་རྒྱུ་འཐུན་པ་ཅི་ལགས།
en: “Blessed One, what is the natural consequence of the arising of a buddha?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སངས་རྒྱས་འབྱུང་བའི་རྒྱུ་འཐུན་པ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་འཐོབ་པའོ། །
en: “Great King, the natural consequence of the arising of a buddha is the attainment of qualities that are conducive to awakening.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་སངས་རྒྱས་འབྱུང་བ་ཇི་ལྟ་བུ་ལགས། བཀའ་སྩལ་པ།
en: “Blessed One, how does a buddha arise?”

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཇི་ལྟ་བ་བཞིན་ནོ། །
en: “Great King, it is the consequence of giving rise to the aspiration for awakening.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཇི་ལྟ་བུ་ལགས།
en: “Blessed One, how does one give rise to the aspiration for awakening?”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་བསྐྱེད་པ་ཇི་ལྟ་བ་བཞིན་ནོ། །
en: “Great King, it is the consequence of giving rise to great compassion.”
